In [1]:
import pandas as pd
import sqlite3

In [3]:
cnx = sqlite3.connect('binaracademy.db')

In [4]:
cnx.execute('CREATE TABLE users(username varchar(255), email varchar(255));')

In [27]:
pd.read_sql_query("SELECT name from sqlite_master WHERE type='table';",cnx)

    name
0  users

In [28]:
cnx.execute("INSERT INTO users VALUES ('Ivan', 'hivanarmadi@gmail.com')")

In [29]:
cursor = cnx.execute("select * from users")

In [30]:
for row in cursor:
    print(row)

('Frank', 'hivanarmadi@gmail.com')
('Frank', 'hivanarmadi@gmail.com')
('Ivan', 'hivanarmadi@gmail.com')

In [31]:
#

cnx.execute("UPDATE users set username='Frank' where username='Ivan'")

In [33]:
pd.read_sql_query("SELECT * from users", cnx)

  username                  email
0    Frank  hivanarmadi@gmail.com
1    Frank  hivanarmadi@gmail.com
2    Frank  hivanarmadi@gmail.com

In [34]:
cnx.execute("Delete from users where email='hivanarmadi@gmail.com'")

In [35]:
pd.read_sql_query("SELECT * from users", cnx)

Empty DataFrame
Columns: [username, email]
Index: []

In [36]:
cnx.execute("INSERT INTO users VALUES ('Ivan', 'hivanarmadi@gmail.com')")
cnx.execute("INSERT INTO users VALUES ('Frank', 'frank@gmail.com')")

In [37]:
pd.read_sql_query("SELECT * from users", cnx)

  username                  email
0     Ivan  hivanarmadi@gmail.com
1    Frank        frank@gmail.com